app/views/projects/index.html.erb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
            <td><%= task.status %></td>
            <td><%= task.project.name if task.project.present? %></td>