app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @task = Task.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`user_type` = 'developer'
SELECT `projects`.* FROM `projects`
---
  def new_user_task
    @task = current_user.tasks_creator.build
    d = User.find_all_by_user_type("developer")
    p = Project.all

INSERT INTO "tasks" ("created_at", "creator_id", "description", "developer_id", "image", "project_id", "status", "task_type", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def user_create_task
    @task = current_user.tasks_creator.build(params[:task])
    if @task.save

SELECT `users`.* FROM `users` WHERE `users`.`user_type` = 'developer'
---
  def new
    @task = @project.tasks.build
    d = User.find_all_by_user_type("developer")

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "2"]]
SELECT `users`.* FROM `users` WHERE `users`.`user_type` = 'developer'
---
  def edit
    @task = Task.find(params[:id])
    @project = Project.find(@task.project_id)
    d = User.find_all_by_user_type("developer")

INSERT INTO `tasks` (`created_at`, `creator_id`, `description`, `developer_id`, `image`, `project_id`, `status`, `task_type`, `title`, `updated_at`) VALUES ('2014-01-25 05:56:14', 1, 'something went wrong', NULL, '11020005-F08.jpg', 1, 'New', 'Bug', 'Report', '2014-01-25 05:56:14')
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def create
    @task = @project.tasks.build(params[:task])
    @task.creator_id = current_user.id
    if @task.save

      user = User.find(params[:task][:developer_id])
      project = Project.find(@task.project_id)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "task_type" = 'Bug', "status" = 'New', "developer_id" = 3, "description" = 'Automate the filing system in Netscaps..!', "updated_at" = '2013-05-29 03:25:55.398607' WHERE "tasks"."id" = 7
---
  def update
    @task = Task.find(params[:id])
    if @task.update_attributes(params[:task])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]
---
  def destroy
    @task = Task.find(params[:id])
    if @task.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "3"]]
---
  def load_project
    @project = Project.find(params[:project_id])