app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `email`, `remember_me_token`, `remember_me_token_expires_at`, `salt`, `updated_at`, `user_type`) VALUES ('2014-01-25 05:53:34', '$2a$10$zfCY3ubAc6K/4tQo1twpgOLC85x.TGU.T0G79vokMtXGTM1wKHE92', 'faisal.bhatti@devsinc.com', NULL, NULL, '56Cd5fgzraXtph2JmnYp', '2014-01-25 05:53:34', 'manager')
---
  def create
    @user = User.new(params[:user])
    #return render :json => @user
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def created_bugs
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
---
  def developed_bugs
    @user = User.find(params[:id])